-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 
-- 伺服器版本： 10.4.6-MariaDB
-- PHP 版本： 7.3.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `1091_se`
--

-- --------------------------------------------------------

--
-- 資料表結構 `mymoney`
--

CREATE TABLE `mymoney` (
  `id` int(11) NOT NULL,
  `event` text COLLATE utf8_unicode_ci NOT NULL,
  `money` int(11) NOT NULL,
  `content` text COLLATE utf8_unicode_ci NOT NULL,
  `time` datetime NOT NULL,
  `status` text COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 傾印資料表的資料 `mymoney`
--

INSERT INTO `mymoney` (`id`, `event`, `money`, `content`, `time`, `status`) VALUES
(1, '生活費', 10000, '爸媽給的', '0000-00-00 00:00:00', '結算'),
(2, '零用錢', 10000, '爸媽給的', '0000-00-00 00:00:00', '結算'),
(3, '餐費', 1000, '11', '2021-01-13 02:06:36', '支出'),
(4, '餐費', 500, '晚餐', '2021-01-13 02:35:33', '支出'),
(5, '餐費', 1000, '早餐', '2021-01-13 02:43:32', '支出'),
(6, '餐費', 1000, '撿到錢好爽喔', '2021-01-01 00:00:00', '結算'),
(7, '餐費', 2000, '又撿到了阿', '0000-00-00 00:00:00', '收入'),
(8, '生活費', 5000, '爸媽給的', '0000-00-00 00:00:00', '收入'),
(9, '生活費', 1000, '媽媽給的', '0000-00-00 00:00:00', '收入'),
(10, '生活費', 1000, '媽媽給的', '2021-01-13 09:54:22', '收入'),
(11, '餐費', 1000, '午餐', '2021-01-13 00:00:10', '支出'),
(12, '打工', 2500, '助教', '2021-01-13 09:54:22', '收入'),
(13, '餐費', 1000, '小民該死的欠錢不還', '2021-01-13 10:02:26', '收入'),
(14, '購物', 18490, '跟小民借錢買air pod max', '2020-10-09 10:10:01', '結算'),
(15, '生活費', 1000, '爸媽給的', '2021-01-13 10:45:59', '收入'),
(16, '生活費', 1000, '爸媽給的', '2021-01-13 10:46:16', '收入'),
(17, '生活費', 1000, '爸媽給的', '2021-01-13 10:47:23', '收入'),
(18, '生活費', 1000, '爸媽給的', '2021-01-13 10:47:32', '收入'),
(19, '交通費', 1000, '加油', '2020-01-13 13:18:44', '結算'),
(20, '購物', 1000, '午餐', '2021-01-13 13:26:02', '支出'),
(21, '餐費', 1000, '午餐', '2021-01-13 13:26:12', '支出'),
(22, '生活費', 1000, '他真的需要', '2021-01-13 14:22:43', '收入'),
(23, '生活費', 100000, '爽阿', '2021-01-13 20:30:00', '收入'),
(24, '交通費', 1000, '幫出加油錢', '2021-01-13 15:36:18', '支出'),
(25, '交通費', 200, '機車加油', '2021-01-13 16:41:59', '支出'),
(26, '零用錢', 10000, '發大財了', '2021-01-13 16:42:16', '收入'),
(27, '購物', 1000, '我室友不還錢', '2021-01-13 16:43:04', '收入'),
(28, '交通費', 1250, '我沒錢加油跟室友借', '2021-01-14 00:39:18', '支出'),
(29, '購物', 10000, '媽媽給的', '2021-01-14 00:42:38', '支出'),
(30, '生活費', 10000, '爸爸給的', '2021-01-14 00:55:21', '收入'),
(31, '餐費', 1000, '加油', '2021-01-14 12:19:00', '結算'),
(32, '生活費', 1000, '撿到的', '0000-00-00 00:00:00', '收入'),
(33, '餐費', 100, 'baku', '2021-01-14 12:20:08', '結算'),
(34, '餐費', 100, 'baku', '2021-01-14 12:20:29', '收入'),
(35, '購物', 1000, '買東西沒錢只能借錢', '2021-01-14 13:22:34', '負債');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `mymoney`
--
ALTER TABLE `mymoney`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `mymoney`
--
ALTER TABLE `mymoney`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=36;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
